INSERT INTO singer (singer_name)
VALUES 
	('Скриптонит'),
	('Баста'),
	('Beyonce'),
	('Моргенштерн'),
	('Rihanna'),
	('Виктор Цой гр Кино'),
	('ДДТ'),
	('Круг')
;

INSERT INTO genre (genre_name)
VALUES 
	('Rap'),
	('R&B'),
	('Pop'),
	('Rock'),
	('Шансон')
;

INSERT INTO genre_singer (genre_id, singer_id)
VALUES 
	(1, 1),
	(1, 2),
	(2, 3),
	(2, 4),
	(3, 5),
	(4, 6),
	(4, 7),
	(5, 8),
	(3, 3),
	(2, 5)
;

INSERT INTO album (album_name, release_album)
VALUES 
	('Уроборос', '2017-12-16'),
	('Баста 1', '2006-11-16'),
	('Lemonade', '2018-04-23'),
	('Last one', '2020-10-21'),
	('Loud', '2019-11-12'),
	('Группа крови', '1988-01-05'),
	('Это всё...', '2020-12-11'),
	('Жиган лимон', '1994-05-14')
;

INSERT INTO track (track_name, duration, album_id)
VALUES 
	('Baby mama', '00:03:52', '1'),
	('Положение', '00:04:43', '1'),
	('Так плачет весна', '00:03:52', '2'),
	('Мама', '00:04:14', '2'),
	('Hold up', '00:05:17', '3'),
	('Sorry', '00:04:26', '3'),
	('TATU', '00:02:23', '4'),
	('My skin', '00:05:28', '5'),
	('Cheers', '00:04:42', '5'),
	('Группа крови', '00:03:10', '6'),
	('Война', '00:04:05', '6'),
	('Моя осень', '00:04:47', '7'),
	('Ветер', '00:04:50', '7'),
	('Кольщик', '00:06:09', '8'),
	('Владимирский централ', '00:04:17', '8')
	('Umbrella', '00:04:26', '5'),
	('Listen', '00:02:23', '3')
;

INSERT INTO collection (collection_name, release_collection)
VALUES 
	('Rap music', '2004-06-21'),
	('R&B music', '2012-03-12'),
	('Pop music', '2010-08-23'),
	('Rock music', '2008-12-03'),
	('Сборник шансона', '2005-04-29'),
	('Популярное', '2011-05-13'),
	('На все времена', '2005-10-17'),
	('Танцевальный', '2018-12-09')
;

INSERT INTO track_collection (track_id, collection_id)
VALUES 
	(1, 1),
	(2, 1),
	(3, 1),
	(4, 1),
	(5, 2),
	(6, 2),
	(7, 2),
	(8, 3),
	(9, 3),
	(10, 4),
	(11, 4),
	(12, 4),
	(13, 4),
	(14, 5),
	(15, 5),
	(8, 6),
	(3, 6),
	(10, 7),
	(12, 7),
	(15, 7),
	(5, 8),
	(8, 8),
	(9, 8)
;


